%%%----------------------------------------------------------------------
%%%
%%% @author kebo
%%% @date  2012.04.19
%%% @doc 玩家帐号相关定义
%%%
%%%----------------------------------------------------------------------
-ifndef(ACCOUNT_HRL).
-define(ACCOUNT_HRL, true).

%% 帐号进度状态(用来统计流失率)
-define(ACCOUNT_STATUS_INIT, 0).            % 创建帐号
-define(ACCOUNT_STATUS_LOAD_CREATE, 1).     % 创建角色加载完成
-define(ACCOUNT_STATUS_FINISH_CREATE, 2).   % 创建角色
-define(ACCOUNT_STATUS_ENTER, 3).           % 进入游戏

%% record定义
-record(account, {
        accname,        % 平台帐号名
        status,         % 状态
        time            % 时间
    }).

-endif. % ACCOUNT_HRL

-define(FIRST_NAME_LIST, ["欧阳","司马","上官","夏侯","诸葛","东方","赫连","皇甫","公冶","拓跋","太叔","公孙","令狐","轩辕","钟离","东郭","司徒","呼延","宇文","司空","百里","南宫","完颜","纳兰","耶律","赵","钱","孙","李","周","吴","郑","王","冯","陈","诸","卫","蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","粱","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","钟","徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯","咎","管","卢","莫","经","房","裘","缪","干","解","应","宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","於","惠","甄","魏","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓","牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景","詹","束","龙","叶","幸","司","韶","郜","黎","蓟","薄","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","郁","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","却","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农","温","别","庄","晏","柴","翟","阎","充","慕","连","茹","习","宦","艾","鱼","容","向","古","易","慎","戈","廖","庚","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄","阙","东","殴","殳","沃","利","蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空","曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","后","荆","红","游","竺","权","逯","盖","益","桓","公","佟"]).

-define(LAST_NAME_1, ["剑南","浩","靖","锋","飞","小鱼","小凡","羽","誉","灵均","天骐","望舒","陆离","珵美","辰良","安歌","杜若","翾飞","青云","承宇","嘉树","翼遥","辰星","耀灵","凯风","琬琰","冬荣","绎心","晏晏","凤鸣","凌恒","依斐","景云","鸿永","俊彦","嘉志","庆云","舒啸","无涯","凌波","清野","潇然","致远","浩宇","子轩","炎彬","靖琪","昊天","凛","霆","铭","萧","冥","遥","臻","珩","博","凡"]).

-define(LAST_NANE_2, ["语嫣","倩","静儿","敏","婷","雪","玉","姬","汀兰","德馨","蔓芩","霜华","兰心","冷香","兰芷","芳菲","凌波","佳瑶","妙彤","思彤","慕灵","宛儿","若烟","念薇","凌萱","惜霜","幻莲","碧菡","以蓝","夏岚","映容","绮菱","香薇","秋灵","听露","宛筠","诗珊","含芙","语薇","雅寒","灵凡","念瑶","冰蝶","慕卉","初晴","傲柔","惜珊","怀薇","冬灵","筝","贞","菀","茗","璎","芯","盈","妍","诗"]).
